zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_processing.c
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_EN)
            case (uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E:
            case (uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E:
                status = Cy_CapSense_DpProcessLiquidLevel(ptrWdConfig, context);
                break;
        #endif

        default:
            /* No other widget types */
            break;
    }

    return status;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpProcessIsxWidgetStatus
****************************************************************************//**
*
* Updates the status of the ISX widget in the Data Structure.
*
* This function determines the type of widget and runs the appropriate function
* that implements the status update algorithm for this type of widget.
*
* When the widget-specific processing completes this function updates the
* sensor and widget status registers in the data structure.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpProcessIsxWidgetStatus(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    switch (ptrWdConfig->wdType)
    {
        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_ISX_BUTTON_EN)
            case (uint8_t)CY_CAPSENSE_WD_BUTTON_E:
                Cy_CapSense_DpProcessButton(ptrWdConfig);
                break;
        #endif

        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_ISX_LINEAR_SLIDER_EN)
            case (uint8_t)CY_CAPSENSE_WD_LINEAR_SLIDER_E:
                Cy_CapSense_DpProcessSlider(ptrWdConfig);
                break;
        #endif

        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_ISX_PROXIMITY_EN)
            case (uint8_t)CY_CAPSENSE_WD_PROXIMITY_E:
                Cy_CapSense_DpProcessProximity(ptrWdConfig);
                break;
        #endif

        default:
            /* No other widget types */
            break;
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpProcessWbxWidgetStatus
****************************************************************************//**
*
* Updates the status of the WBX widget in the Data Structure.
*
* This function determines the type of widget and runs the appropriate function
* that implements the status update algorithm for this type of widget.
*
* When the widget-specific processing completes this function updates the
* sensor and widget status registers in the data structure.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpProcessWbxWidgetStatus(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    switch (ptrWdConfig->wdType)
    {
        case (uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E:
            Cy_CapSense_DpProcessButton(ptrWdConfig);
            break;

        default:
            /* No other widget types */
            break;
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) */


/*******************************************************************************
* Function Name: Cy_CapSense_DpProcessSensorRawCountsExt
****************************************************************************//**
*
* Performs customized processing of the sensor raw counts.
*
* If all bits are set at once, the default processing order will take place.
* For a custom order, this function can be called multiple times and execute
* one task at a time.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
* \param ptrSnsContext
* The pointer to the sensor context structure.
*
* \param ptrSnsRawHistory
* The pointer to the filter history.
*
* \param ptrSnsRawHistoryLow
* The pointer to the extended filter history.
*
* \param mode
* The bit-mask with the data processing tasks to be executed.
* The mode parameters can take the following values:
* - CY_CAPSENSE_PROCESS_FILTER     (0x01) Run Firmware Filter
* - CY_CAPSENSE_PROCESS_BASELINE   (0x02) Update Baselines
* - CY_CAPSENSE_PROCESS_DIFFCOUNTS (0x04) Update Difference Counts
* - CY_CAPSENSE_PROCESS_CALC_NOISE (0x08) Calculate the noise
*                   (only in full auto-tuning mode)
* - CY_CAPSENSE_PROCESS_THRESHOLDS (0x10) Update the thresholds
*                   (only in full auto-tuning mode)
* - CY_CAPSENSE_PROCESS_ALL               Execute all tasks
*
* \param ptrSnsBslnInv
* The pointer to the sensor baseline inversion used for BIST if enabled.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified sensor processing operation:
* - CY_CAPSENSE_STATUS_SUCCESS if operation was successfully completed;
* - Non-zero - if baseline processing of any
* sensor of the specified widget failed. The result is concatenated with the index
* of failed sensor.
*
*******************************************************************************/
uint32_t Cy_CapSense_DpProcessSensorRawCountsExt(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                cy_stc_capsense_sensor_context_t * ptrSnsContext,
                uint16_t * ptrSnsRawHistory,
                uint8_t * ptrSnsRawHistoryLow,
                uint32_t mode,
                uint16_t * ptrSnsBslnInv,
                const cy_stc_capsense_context_t * context)
{
    uint32_t  result = CY_CAPSENSE_STATUS_SUCCESS;
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdConfig->ptrWdContext;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_ACTIVE_FULL_EN)
        cy_stc_capsense_smartsense_csd_noise_envelope_t * ptrNEHistory = ptrWdConfig->ptrNoiseEnvelope;
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_RAWCOUNT_FILTER_EN)
        if (0u != (mode & CY_CAPSENSE_PROCESS_FILTER))
        {
            Cy_CapSense_FtRunEnabledFiltersInternal(ptrWdConfig, ptrSnsContext,
                                                    ptrSnsRawHistory, ptrSnsRawHistoryLow);
        }
    #else
        (void)ptrSnsRawHistory;
        (void)ptrSnsRawHistoryLow;
    #endif

    /* Run auto-tuning activities */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_ACTIVE_FULL_EN)
        if ((((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E != ptrWdConfig->wdType) &&
             ((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E != ptrWdConfig->wdType)) &&
            (((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E != ptrWdConfig->wdType)) &&
            (0u == (CY_CAPSENSE_RC_FILTER_ALP_EN_MASK & ptrWdConfig->rawFilterConfig)) &&
            (((CY_CAPSENSE_CSD_GROUP == ptrWdConfig->senseMethod) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_CSD_ACTIVE_FULL_EN)) ||
             ((CY_CAPSENSE_ISX_GROUP == ptrWdConfig->senseMethod) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_ISX_ACTIVE_FULL_EN))))
        {
            Cy_CapSense_RunNoiseEnvelope_Lib(ptrSnsContext->raw, ptrWdCxt->sigPFC, ptrNEHistory);
            Cy_CapSense_DpUpdateThresholds(ptrWdCxt, ptrNEHistory, 0u);
            #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_PROXIMITY_EN)
                if ((uint8_t)CY_CAPSENSE_WD_PROXIMITY_E == ptrWdConfig->wdType)
                {
                    ptrWdCxt->proxTh = ptrWdCxt->fingerTh;
                    ptrWdCxt->fingerTh = (uint16_t)(((uint32_t)ptrWdCxt->fingerTh *
                        context->ptrCommonConfig->proxTouchCoeff) / CY_CAPSENSE_PERCENTAGE_100);
                }
            #endif
            ptrNEHistory++;
        }
    #endif

    if (((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E != ptrWdConfig->wdType) &&
        ((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E != ptrWdConfig->wdType))
    {
        if (0u != (mode & CY_CAPSENSE_PROCESS_BASELINE))
        {
            result = Cy_CapSense_FtUpdateBaseline(ptrWdCxt, ptrSnsContext, ptrSnsBslnInv, context);
        }
        if (0u != (mode & CY_CAPSENSE_PROCESS_DIFFCOUNTS))
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_REGULAR_RC_CMF_FILTER_EN)
                if (0u != (ptrWdConfig->rawFilterConfig & CY_CAPSENSE_RC_FILTER_CM_EN_MASK))
                {
                    Cy_CapSense_DpUpdateDifferencesCmf(ptrSnsContext);
                }
                else
            #endif
            {
                Cy_CapSense_DpUpdateDifferences(ptrWdCxt, ptrSnsContext);
            }
        }
    }

    return result;
}


