zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_processing.c
/*******************************************************************************
* Function Name: Cy_CapSense_DpUpdateThresholds
****************************************************************************//**
*
* Updates noise and finger thresholds for a specified widget.
*
* Used for smart sensing algorithm.
*
* \param ptrWdContext
* The pointer to the widget context structure.
*
* \param ptrNoiseEnvelope
* The pointer to the noise-envelope history structure.
*
* \param startFlag
* The flag indicates when a new widget is processed.
*
*******************************************************************************/
void Cy_CapSense_DpUpdateThresholds(
                cy_stc_capsense_widget_context_t * ptrWdContext,
                const cy_stc_capsense_smartsense_csd_noise_envelope_t * ptrNoiseEnvelope,
                uint32_t startFlag)
{
    cy_stc_capsense_smartsense_update_thresholds_t thresholds;

    /* Calculate Thresholds */
    thresholds.fingerTh = ptrWdContext->fingerTh;
    Cy_CapSense_UpdateThresholds_Lib(ptrNoiseEnvelope, &thresholds, ptrWdContext->sigPFC, startFlag);

    /* Update CAPSENSE&trade; context */
    ptrWdContext->fingerTh = thresholds.fingerTh;
    ptrWdContext->noiseTh = (uint16_t)thresholds.noiseTh;
    ptrWdContext->nNoiseTh = (uint16_t)thresholds.nNoiseTh;
    ptrWdContext->hysteresis = (uint16_t)thresholds.hysteresis;
}


/*******************************************************************************
* Function Name: Cy_CapSense_DpUpdateDifferences
****************************************************************************//**
*
* Calculates new difference values.
*
* This function calculates the difference between the baseline and raw counts.
* If the difference is positive (raw > baseline), and higher than the widget
* noise threshold, it is saved into the data structure for further processing.
* Otherwise the difference is set to zero. The final difference value is saved
* with the subtracted noise threshold value.
*
* \param ptrWdContext
* The pointer to the widget context structure.
*
* \param ptrSnsContext
* The pointer to the sensor context structure.
*
*******************************************************************************/
void Cy_CapSense_DpUpdateDifferences(
                const cy_stc_capsense_widget_context_t * ptrWdContext,
                cy_stc_capsense_sensor_context_t * ptrSnsContext)
{
    ptrSnsContext->diff = 0u;
    if ((uint32_t)ptrSnsContext->raw > ((uint32_t)ptrSnsContext->bsln + ptrWdContext->noiseTh))
    {
        ptrSnsContext->diff = ptrSnsContext->raw - ptrSnsContext->bsln;
    }
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_REGULAR_RC_CMF_FILTER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpUpdateDifferencesCmf
****************************************************************************//**
*
* Calculates new difference values.
*
* This function calculates the difference between the baseline and raw counts.
* If the difference is positive (raw > baseline), it is saved into the data
* structure for further processing. Otherwise the difference is set to zero.
*
* \param ptrSnsContext
* The pointer to the sensor context structure.
*
*******************************************************************************/
void Cy_CapSense_DpUpdateDifferencesCmf(
                cy_stc_capsense_sensor_context_t * ptrSnsContext)
{
    ptrSnsContext->diff = 0u;
    if ((uint32_t)ptrSnsContext->raw > (uint32_t)ptrSnsContext->bsln)
    {
        ptrSnsContext->diff = ptrSnsContext->raw - ptrSnsContext->bsln;
    }
}
#endif


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_ProcessWbxCorrection
****************************************************************************//**
*
* Executes Wheatstone bridge raw count correction to compensate 
* sensor-to-sensor variation.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_ProcessWbxCorrection(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                const cy_stc_capsense_context_t * context)
{
    const cy_stc_capsense_widget_config_t * ptrWdCfg = ptrWdConfig;
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdCfg->ptrWdContext;

    cy_stc_capsense_wbx_profile_t profile;

    int32_t cCorrZero;
    int32_t cCorrClbr;
    int32_t cCorrRaw;

    profile.rLoad = ptrWdCfg->wbxResistorSeries;
    profile.rBridge = ptrWdCfg->wbxResistorBridge;

    /* Ideal equation: R_REF = 1 / (REF_CDAC * LSB_CDAC * F_MOD)
     * REF_CDAC = [1..255]
     * F_MOD = [1M..46M]
     * LSB_CDAC = 8870*10^-18
     * scale = 1
     * Range = [9.6k to 113M] * scale */
    profile.rRef = CY_CAPSENSE_SCALE_10E9 / CY_CAPSENSE_REF_CDAC_LSB;
    profile.rRef *= CY_CAPSENSE_SCALE_1000;
    profile.rRef /= ptrWdCxt->cdacRef;
    profile.rRef *= context->ptrInternalContext->modClk;
    profile.rRef /= CY_CAPSENSE_MOD_CLOCK_MHZ;

    /* Ideal equation: K_CUT = 2 * COMP_CDAC / REF_CDAC / COMP_DIV
     * COMP_DIV = [3..240]
     * Scale = 1000000
     * Range = [-170 to +170] * scale */
    profile.kCut = (int32_t)CY_CAPSENSE_SCALE_10E6 * 2;
    profile.kCut *= ptrWdCfg->ptrSnsContext->cdacComp;
    profile.kCut /= ((int32_t)ptrWdCxt->cdacCompDivider * ptrWdCxt->cdacRef);
    if (0u == (CY_CAPSENSE_WD_WBX_COMPENSATION_DIRECTION_MASK & ptrWdCfg->ptrWdContext->status))
    {
        /* Adds sign based on direction: Direct = -1 */
        profile.kCut *= -1;
    }

    /* Profile #1: Zero */
    profile.dc = 0;
    Cy_CapSense_WbxCorrectionProfile(&profile);
    cCorrZero = profile.cCorr;

    /* Profile #2: Calibration */
    /* Ideal equation: DC = CALIBRATION_RAW / MAX_RAW
     * Scale = 1000000
     * Range = [0 to 1] * scale */
    profile.dc = (int32_t)ptrWdCxt->maxRawCountRow * CY_CAPSENSE_SCALE_10E6;
    profile.dc /= ptrWdCxt->maxRawCount;
    Cy_CapSense_WbxCorrectionProfile(&profile);

    cCorrClbr = cCorrZero * profile.cCorr;
    cCorrClbr /= CY_CAPSENSE_SCALE_10E4;
    cCorrClbr *= profile.dCorr;
    cCorrClbr /= CY_CAPSENSE_SCALE_10E4;
    cCorrClbr = CY_CAPSENSE_SCALE_10E4 - cCorrClbr;
    cCorrClbr *= (int32_t)ptrWdCxt->maxRawCountRow;
    cCorrClbr /= CY_CAPSENSE_SCALE_10E4;

    /* Profile #3: Rawcounts */
    /* Ideal equation: DC = RAW / MAX_RAW
     * Scale = 1000000
     * Range = [0 to 1] * scale */
    profile.dc = (int32_t)ptrWdCfg->ptrSnsContext->raw * CY_CAPSENSE_SCALE_10E6;
    profile.dc /= ptrWdCxt->maxRawCount;
    Cy_CapSense_WbxCorrectionProfile(&profile);

    cCorrRaw = cCorrZero * profile.cCorr;
    cCorrRaw /= CY_CAPSENSE_SCALE_10E4;
    cCorrRaw *= profile.dCorr;
    cCorrRaw /= CY_CAPSENSE_SCALE_10E4;
    cCorrRaw *= (int32_t)ptrWdCfg->ptrSnsContext->raw;
    cCorrRaw /= CY_CAPSENSE_SCALE_10E4;
    cCorrRaw += cCorrClbr;

    if (0 > cCorrRaw)
    {
        ptrWdCfg->ptrSnsContext->raw = 0u;
    }
    else if ((int32_t)ptrWdCxt->maxRawCount < cCorrRaw)
    {
        ptrWdCfg->ptrSnsContext->raw = ptrWdCxt->maxRawCount;
    }
    else
    {
        ptrWdCfg->ptrSnsContext->raw = (uint16_t)cCorrRaw;
    }
}

