zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_processing.c
/*******************************************************************************
* Function Name: Cy_CapSense_WbxCorrectionProfile
****************************************************************************//**
*
* Executes correction coefficient calculation for Wheatstone bridge widget
* to compensate sensor-to-sensor variation.
*
* The function assumes input arguments already scaled as follows:
* R_REF, R_BRIDGE and R_LOAD without scaling
* K_CUT and DC scaled to 10^6 (means real value is for 1M smaller)
* Results: D_COEFF and C_COEFF scaled to 10^4
*
* \param ptrProfile
* The pointer to the CAPSENSE&trade; structure \ref cy_stc_capsense_wbx_profile_t.
*
*******************************************************************************/

void Cy_CapSense_WbxCorrectionProfile(volatile cy_stc_capsense_wbx_profile_t * ptrProfile)
{
    int32_t bCoeff;
    int32_t bCoeff_den;
    int32_t rxCoeff;
    int32_t rxCoeff_den;
    int32_t cCoeff_den;
    int32_t scale;
    int32_t i;

    /* B_COEFF = R_REF / (K_CUT - DC)
     * Scale = [Run-time defined]
     * Range = [NA] * 10^scale */
    scale = 6;
    bCoeff = ptrProfile->rRef;
    if ((uint32_t)CY_CAPSENSE_HI_LIMIT_NOM > ptrProfile->rRef)
    {
        bCoeff *= CY_CAPSENSE_SCALE_1000;
        scale -= 3;
    }
    if ((uint32_t)CY_CAPSENSE_LO_LIMIT_NOM > ptrProfile->rRef)
    {
        bCoeff *= CY_CAPSENSE_SCALE_10;
        scale--;
    }

    bCoeff_den = ptrProfile->kCut - ptrProfile->dc;
    if ((CY_CAPSENSE_HI_LIMIT_DEN < bCoeff_den) || 
       (-CY_CAPSENSE_HI_LIMIT_DEN > bCoeff_den))
    {
        bCoeff_den /= CY_CAPSENSE_SCALE_1000;
        scale -= 3;
    }
    if ((CY_CAPSENSE_LO_LIMIT_DEN < bCoeff_den) || 
       (-CY_CAPSENSE_LO_LIMIT_DEN > bCoeff_den))
    {
        bCoeff_den /= CY_CAPSENSE_SCALE_10;
        scale--;
    }

    if (0 == bCoeff_den)
    {
        rxCoeff = (int32_t)ptrProfile->rBridge;
    }
    else
    {
        bCoeff /= bCoeff_den;

        /* Ideal equation: RX_COEFF = R_BRIDGE * (B_COEFF - R_LOAD) / (R_BRIDGE + B_COEFF + R_LOAD)
         * Scale = 0
         * Range = [NA] * 10^scale */
        while ((0 > scale) && (CY_CAPSENSE_LO_LIMIT_DEN < bCoeff))
        {
            bCoeff /= CY_CAPSENSE_SCALE_10;
            scale++;
        }
        while ((0 < scale) && ((CY_CAPSENSE_LO_LIMIT_DEN / CY_CAPSENSE_SCALE_10) > bCoeff))
        {
            bCoeff *= CY_CAPSENSE_SCALE_10;
            scale--;
        }
        rxCoeff = (int32_t)ptrProfile->rLoad;
        rxCoeff_den = (int32_t)ptrProfile->rBridge + ptrProfile->rLoad;
        i = scale;
        while (0 < i)
        {
            rxCoeff /= CY_CAPSENSE_SCALE_10;
            rxCoeff_den /= CY_CAPSENSE_SCALE_10;
            i--;
        }
        while (0 > i)
        {
            rxCoeff *= CY_CAPSENSE_SCALE_10;
            rxCoeff_den *= CY_CAPSENSE_SCALE_10;
            i++;
        }
        rxCoeff_den += bCoeff;
        if (0 != rxCoeff_den)
        {
            rxCoeff = bCoeff - rxCoeff;
            scale = 0;
            while ((CY_CAPSENSE_LO_LIMIT < rxCoeff) ||
                  (-CY_CAPSENSE_LO_LIMIT > rxCoeff))
            {
                rxCoeff /= CY_CAPSENSE_SCALE_10;
                scale++;
            }

            rxCoeff *= ptrProfile->rBridge;
            rxCoeff /= rxCoeff_den;
            while (0 < scale)
            {
                rxCoeff *= CY_CAPSENSE_SCALE_10;
                scale--;
            }
        }
        else 
        {
            rxCoeff = -CY_CAPSENSE_SCALE_10E9;
        }
    }

    /* Ideal equation: D_COEFF = R_BRIDGE / RX_COEFF
     * Scale = 10000
     * Range = [0..2] * scale */
    ptrProfile->dCorr = ((int32_t)ptrProfile->rBridge * CY_CAPSENSE_SCALE_10E4) / rxCoeff;

    /* Ideal equation: C_COEFF = (RX_COEFF + R_BRIDGE) / (2 * R_BRIDGE) + (RX_COEFF - R_BRIDGE) / (4 * R_SERIES + 2 * R_BRIDGE)
     * Scale = 10000
     * Range = [0..2] * scale */
    cCoeff_den = (int32_t)ptrProfile->rBridge * 2;
    ptrProfile->cCorr = (rxCoeff + ptrProfile->rBridge);
    ptrProfile->cCorr *= CY_CAPSENSE_SCALE_10E4;
    ptrProfile->cCorr /= cCoeff_den;
    cCoeff_den += ((int32_t)ptrProfile->rLoad * 4);
    ptrProfile->cCorr += (((rxCoeff - ptrProfile->rBridge) * CY_CAPSENSE_SCALE_10E4) / cCoeff_den);
}
#endif


#if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_BUTTON_EN) || \
     (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_MATRIX_EN) || \
     (CY_CAPSENSE_DISABLE != CY_CAPSENSE_WBX_BUTTON_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_DpProcessButton
****************************************************************************//**
*
* Processes the status of the Button widget.
*
* This function processes the status of the CSD/CSX/ISX Button widget and
* CSX Matrix Button widget. It applies the hysteresis and debounce algorithm
* to each sensor difference value. This function is expected to be called
* after each new widget scan. If it is called multiple times for the same
* scan data, the debounce algorithm will not work properly.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpProcessButton(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t snsIndex;
    uint32_t touchTh;
    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_MATRIX_EN)
        uint32_t activeCount = 0u;
        uint32_t startIndex = 0u;
    #endif

    uint8_t * ptrDebounceCnt = ptrWdConfig->ptrDebounceArr;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt = ptrWdConfig->ptrSnsContext;
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdConfig->ptrWdContext;

    ptrWdCxt->status &= (uint32_t)~(uint32_t)CY_CAPSENSE_WD_ACTIVE_MASK;

    /* Go through all widget's sensors */
    for (snsIndex = 0u; snsIndex < ptrWdConfig->numSns; snsIndex++)
    {
        /* Calculate touch threshold based on current sensor state */
        touchTh = (0u == ptrSnsCxt->status) ?
                  ((uint32_t)ptrWdCxt->fingerTh + ptrWdCxt->hysteresis) :
                  ((uint32_t)ptrWdCxt->fingerTh - ptrWdCxt->hysteresis);

