zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_processing.c
    /* Calculate touch threshold based on current slider state */
    touchTh = (0u == (ptrWdCxt->status & CY_CAPSENSE_WD_ACTIVE_MASK)) ?
              ((uint32_t)ptrWdCxt->fingerTh + ptrWdCxt->hysteresis) :
              ((uint32_t)ptrWdCxt->fingerTh - ptrWdCxt->hysteresis);

    if (0u < (*ptrDebounceCnt))
    {
        /* Decrement debounce counter */
        (*ptrDebounceCnt)--;
    }

    /* Check new widget activity */
    for (snsIndex = sensorNumber; snsIndex-- > 0u;)
    {
        ptrSnsCxt->status = (touchTh < ptrSnsCxt->diff) ? CY_CAPSENSE_SNS_TOUCH_STATUS_MASK : 0u;
        wdActive |= ptrSnsCxt->status;
        ptrSnsCxt++;
    }

    /* No touch detected */
    if (0u == wdActive)
    {
        /* Reset debounce counter */
        (*ptrDebounceCnt) = ptrWdCxt->onDebounce;
        ptrWdCxt->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_WD_ACTIVE_MASK | (uint32_t)CY_CAPSENSE_WD_FINGER_TYPE_MASK);
    }

    if (0u == (*ptrDebounceCnt))
    {
        /* New touch detected or touch still exists from previous cycle */
        ptrWdCxt->status |= (uint32_t)CY_CAPSENSE_WD_ACTIVE_MASK;
    }
    else
    {
        if (0u != wdActive)
        {
            /* Clear sensor state if activity was detected but debounce was not passed */
            ptrSnsCxt = ptrWdConfig->ptrSnsContext;

            for (snsIndex = sensorNumber; snsIndex-- > 0u;)
            {
                ptrSnsCxt->status = 0u;
                ptrSnsCxt++;
            }
        }
    }

    /* Centroid processing */
    if (CY_CAPSENSE_WD_ACTIVE_MASK == (ptrWdCxt->status & CY_CAPSENSE_WD_ACTIVE_MASK))
    {
        switch (ptrWdConfig->wdType)
        {
            #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_RADIAL_SLIDER_EN)
                case (uint8_t)CY_CAPSENSE_WD_RADIAL_SLIDER_E:
                    Cy_CapSense_DpCentroidRadial(&newTouch, ptrWdConfig);
                    break;
            #endif

            #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_LINEAR_SLIDER_EN)
                case (uint8_t)CY_CAPSENSE_WD_LINEAR_SLIDER_E:
                    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_DIPLEX_SLIDER_EN)
                        if ((0u != (ptrWdConfig->centroidConfig & CY_CAPSENSE_DIPLEXING_MASK)))
                        {
                            /* Run local maximum search for diplexed slider */
                            Cy_CapSense_DpCentroidDiplex(&newTouch, ptrWdConfig);
                        }
                        else
                        {
                            Cy_CapSense_DpCentroidLinear(&newTouch, ptrWdConfig);
                        }
                    #else
                        Cy_CapSense_DpCentroidLinear(&newTouch, ptrWdConfig);
                    #endif
                    break;
            #endif

            default:
                /* No action on other widget types */
                break;
        }
    }

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POSITION_FILTER_EN)
        /* Position filtering */
        if (0u != (ptrWdConfig->posFilterConfig & CY_CAPSENSE_POSITION_FILTERS_MASK))
        {
            Cy_CapSense_ProcessPositionFilters(&newTouch, ptrWdConfig);
        }
    #endif

    /* Copy positions into public structure */
    ptrWdConfig->ptrWdContext->wdTouch.numPosition = newTouch.numPosition;
    for (snsIndex = 0u; snsIndex < newTouch.numPosition; snsIndex++)
    {
        ptrWdConfig->ptrWdContext->wdTouch.ptrPosition[snsIndex] = newTouch.ptrPosition[snsIndex];
    }
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_SLIDER_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpProcessLiquidLevel
****************************************************************************//**
*
* Processes the status of the liquid level widget.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_LLW_BAD_CONFIG   - Liquid level configuration is not valid 
*                                         or calculation fail.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_DpProcessLiquidLevel(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                cy_stc_capsense_context_t * context)
{
    (void) context;
    uint32_t liquidLevel;
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_SUCCESS;
    cy_stc_capsense_position_t newPosition[CY_CAPSENSE_MAX_CENTROIDS] = 
        {{0u, 0u, 0u, 0u}, {0u, 0u, 0u, 0u}, {0u, 0u, 0u, 0u}};	
    cy_stc_capsense_touch_t newTouch = {&newPosition[0u], CY_CAPSENSE_POSITION_ONE};
    uint32_t scalingFactor = (1uL << CY_CAPSENSE_LLW_RESULT_SHIFT);
    #if ((CY_CAPSENSE_LIQUID_LEVEL_MULTI_LEVEL_EN) || (CY_CAPSENSE_LIQUID_LEVEL_TANK_REMOVAL_DETECTION_EN))
        cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdConfig->ptrWdContext;
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
        uint16_t foamCorrection;
    #endif

    #if (CY_CAPSENSE_LIQUID_LEVEL_MULTI_LEVEL_EN)
        uint32_t multiLevels = (ptrWdConfig->centroidConfig & CY_CAPSENSE_LLW_MULTI_LEVEL_MASK) >> CY_CAPSENSE_LLW_MULTI_LEVEL_POS;
        uint32_t liquidLevelDetection = 0u;
        uint32_t liquidLevelDetectionMask = 0u;
        uint32_t lvl;
        uint8_t * ptrDebounceCnt = ptrWdConfig->ptrDebounceArr;
    #endif

    const void * ptrLlwContext = ptrWdConfig->ptrSnsContext;

    liquidLevel = Cy_CapSense_GetLiquidLevel_Lib(ptrWdConfig->ptrDiplexTable, (const uint16_t *)ptrLlwContext);

    /* Check liquid level validity */
    if (CY_CAPSENSE_LLW_NOT_VALID_DATA != liquidLevel)
    {
        #if (CY_CAPSENSE_LIQUID_LEVEL_TANK_REMOVAL_DETECTION_EN)
            /* Check that the liquid level is above (threshold + hysteresis) */
            if (0u != (liquidLevel & CY_CAPSENSE_LLW_TANK_DETECTION_LEVEL_ABOVE_TH_MASK))
            {  
                ptrWdCxt->status |= (uint32_t)CY_CAPSENSE_WD_TANK_REMOVAL_DETECTION_MASK;
            }
            /* Check that the liquid level is below (threshold + hysteresis) */
            else if (0u != (liquidLevel & CY_CAPSENSE_LLW_TANK_DETECTION_LEVEL_BELOW_TH_MASK))
            {
                ptrWdCxt->status &= (uint32_t)(~CY_CAPSENSE_WD_TANK_REMOVAL_DETECTION_MASK);
            }
            else
            {
                /* 
                * Do nothing, liquid level is within the hysteresis range 
                * from (threshold - hysteresis) to (threshold + hysteresis)
                */
            }
        #endif

        /* Clear liquid level tank detection bits */
        liquidLevel &= (uint32_t)~(CY_CAPSENSE_LLW_TANK_DETECTION_LEVEL_ABOVE_TH_MASK | CY_CAPSENSE_LLW_TANK_DETECTION_LEVEL_BELOW_TH_MASK);

        /* Apply resolution scaling */
        liquidLevel = (((liquidLevel * ptrWdConfig->xResolution) + (scalingFactor >> 1u)) >> CY_CAPSENSE_LLW_RESULT_SHIFT);

        newTouch.ptrPosition->x = (uint16_t)liquidLevel;

