zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_processing.c
        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_POSITION_FILTER_EN)
            /* Position filtering */
            if (0u != (ptrWdConfig->posFilterConfig & CY_CAPSENSE_POSITION_FILTERS_MASK))
            {
                Cy_CapSense_ProcessPositionFilters(&newTouch, ptrWdConfig);
            }
        #endif

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
            if (0u != (ptrWdConfig->centroidConfig & CY_CAPSENSE_LLW_FOAM_EN_MASK))
            {
                /* Apply level correction factor */
                foamCorrection = 0u;
                if (((ptrWdConfig - 1u)->ptrWdContext->wdTouch.ptrPosition->x) > newTouch.ptrPosition->x)
                {
                    foamCorrection = (ptrWdConfig - 1u)->ptrWdContext->wdTouch.ptrPosition->x - newTouch.ptrPosition->x;
                }
                foamCorrection = (uint16_t)(((uint32_t)foamCorrection * (uint32_t)ptrWdConfig->ptrWdContext->proxTh) >> 8u);

                if (foamCorrection >= newTouch.ptrPosition->x)
                {
                    newTouch.ptrPosition->x = 0u;
                }
                else
                {
                    newTouch.ptrPosition->x = newTouch.ptrPosition->x - foamCorrection;
                }
            } 
        #endif

        ptrWdConfig->ptrWdContext->wdTouch.ptrPosition->x = newTouch.ptrPosition->x;

        #if (CY_CAPSENSE_LIQUID_LEVEL_MULTI_LEVEL_EN)
            for (lvl = 1u; lvl <= multiLevels; lvl++)
            {
                /* Calculate liquid level detection threshold */
                switch(lvl)
                {
                    case 1u:
                        liquidLevelDetection = (0u == (ptrWdCxt->status & CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL1_MASK)) ?
                            ((uint32_t)ptrWdCxt->fingerTh + ptrWdCxt->hysteresis) :
                            ((uint32_t)ptrWdCxt->fingerTh - ptrWdCxt->hysteresis);
                            liquidLevelDetectionMask = (uint32_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL1_MASK;
                        break;
                    case 2u:
                        liquidLevelDetection = (0u == (ptrWdCxt->status & CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL2_MASK)) ?
                            ((uint32_t)ptrWdCxt->liquidPresenceLevel2 + ptrWdCxt->hysteresis) :
                            ((uint32_t)ptrWdCxt->liquidPresenceLevel2 - ptrWdCxt->hysteresis);
                            liquidLevelDetectionMask = (uint32_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL2_MASK;
                        break;
                    case 3u:
                        liquidLevelDetection = (0u == (ptrWdCxt->status & CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL3_MASK)) ?
                            ((uint32_t)ptrWdCxt->liquidPresenceLevel3 + ptrWdCxt->hysteresis) :
                            ((uint32_t)ptrWdCxt->liquidPresenceLevel3 - ptrWdCxt->hysteresis);
                            liquidLevelDetectionMask = (uint32_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL3_MASK;
                        break;
                    default:
                        /* Invalid liquid detection level */
                        break;
                }

                if (0u < (*ptrDebounceCnt))
                {
                    /* Decrement debounce counter */
                    (*ptrDebounceCnt)--;
                }

                /* No liquid or liquid below threshold */
                if (newTouch.ptrPosition->x < liquidLevelDetection)
                {
                    /* Reset debounce counter */
                    *ptrDebounceCnt = ptrWdCxt->onDebounce;
                    ptrWdCxt->status &= ~liquidLevelDetectionMask;
                }

                /* Liquid detected or liquid still exists */
                if (0u == (*ptrDebounceCnt))
                {
                    /* Update widget status */
                    ptrWdCxt->status |= liquidLevelDetectionMask;
                }

                ptrDebounceCnt++;
            }
        #endif
    }
    else
    {
        status = CY_CAPSENSE_STATUS_LLW_BAD_CONFIG;
    }

    return status;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_EN) */


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_DpProcessCsdMatrix
****************************************************************************//**
*
* Processes the status of the CSD Matrix Button widget.
*
* This function processes the status of the CSD Matrix Button widget.
* It applies the hysteresis and debounce algorithm to each sensor value.
*
* Then the function analyzes how many row and column sensors are active.
* If only one per row and one per column, the function considers this as
* a valid touch and updates the corresponding Data Structure registers
* with the button id and active row and column sensors.
*
* If multiple sensors are active in row or column sensors, this function sets
* the corresponding registers to the CY_CAPSENSE_POSITION_MULTIPLE
* value that indicates that it is not possible to detect the touched button id.
*
* This function is expected to be called after each new widget scan. If it is
* called multiple times for the same scan data, the debounce algorithm
* will not work properly.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpProcessCsdMatrix(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t snsIndex;
    uint32_t touchTh;

    uint32_t colNumber = ptrWdConfig->numCols;
    uint8_t * ptrDebounceCnt = ptrWdConfig->ptrDebounceArr;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt = ptrWdConfig->ptrSnsContext;
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdConfig->ptrWdContext;
    cy_stc_capsense_position_t * ptrSnsTouch = ptrWdCxt->wdTouch.ptrPosition;

    uint32_t numActiveRows = 0u;
    uint32_t numActiveCols = 0u;

