zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_processing.c
    mpOrderLocal = ptrWdCfg->mpOrder;
    ptrMpTable = ptrWdCfg->ptrMpTable;

    if (mpOrderLocal >= CY_CAPSENSE_MPTX_MIN_ORDER)
    {
        result = CY_CAPSENSE_STATUS_SUCCESS;

        (void)memcpy((void *)&deconvCoefRot[0u], (const void *)&ptrMpTable->deconvCoef[0u], mpOrderLocal * CY_CAPSENSE_BYTES_IN_16_BITS);
        (void)memcpy((void *)&deconvCoefRot[mpOrderLocal], (const void *)&ptrMpTable->deconvCoef[0u], mpOrderLocal * CY_CAPSENSE_BYTES_IN_16_BITS);

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
            if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
            {
                ptrMpTable++;
                (void)memcpy((void *)&deconvCoefRot[CY_CAPSENSE_MPSC_MAX_ORDER * 2u], (const void *)&ptrMpTable->deconvCoef[0u], ptrWdCfg->mpOrderRows * CY_CAPSENSE_BYTES_IN_16_BITS);
                (void)memcpy((void *)&deconvCoefRot[(CY_CAPSENSE_MPSC_MAX_ORDER * 2u) + ptrWdCfg->mpOrderRows], (const void *)&ptrMpTable->deconvCoef[0u], ptrWdCfg->mpOrderRows * CY_CAPSENSE_BYTES_IN_16_BITS);
            }
        #endif

        for (freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
        {
            while (snsIdx < ptrWdCfg->numSns)
            {
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
                    if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
                    {
                        if (snsIdx >= ptrWdCfg->numCols)
                        {
                            ptrDeconvTable = &deconvCoefRot[CY_CAPSENSE_MPSC_MAX_ORDER * 2u];
                            mpOrderLocal = ptrWdCfg->mpOrderRows;
                        }
                    }
                #endif

                /* Copy vector from sensors to localBuf */
                for (idx = 0u; idx < mpOrderLocal; idx++)
                {
                    localBuf[idx] = (int32_t)ptrWdCfg->ptrSnsContext[idx + snsIdx +
                                    (context->ptrCommonConfig->numSns * freqChIndex)].raw;
                }

                /* Multiply vector stored in localBuf by the matrix of deconvolution coefficients */
                idx = 0u;
                while (idx < mpOrderLocal)
                {
                    accum = 0;
                    rotIdx = idx;
                    sumIdx = 0u;
                    while (sumIdx < mpOrderLocal)
                    {
                        accum += localBuf[sumIdx] * ptrDeconvTable[rotIdx];
                        sumIdx++;
                        rotIdx++;
                    }

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
                        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
                        {
                            sign = (0 > accum) ? -1 : 1;
                            accum *= sign;
                            accumTmp = (uint32_t)accum;

                            /* Shift the result in such a way that guarantees no overflow */
                            accumTmp >>= CY_CAPSENSE_SCALING_SHIFT;

                            /* Store to the temporary signed raw counts buffer */
                            accum_raw[idx+snsIdx] = (int32_t)accumTmp;
                            accum_raw[idx+snsIdx] *= sign;
                        }
                    #endif

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_TX_ENABLED)
                        if (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod)
                        {
                            if (0 > accum)
                            {
                                accumTmp = 0u;
                            }
                            else
                            {
                                accumTmp = (uint32_t)accum;

                                /* Shift the result in such a way that guarantees no overflow */
                                accumTmp >>= CY_CAPSENSE_SCALING_SHIFT;

                                if ((uint32_t)UINT16_MAX < accumTmp)
                                {
                                    accumTmp = UINT16_MAX;
                                }
                            }

                            /* Convert the result to unsigned 16 bit and store in the target buffer */
                            ptrWdCfg->ptrSnsContext[idx + snsIdx +
                                            (context->ptrCommonConfig->numSns * freqChIndex)].raw = (uint16_t)accumTmp;
                        }
                    #endif /* CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_TX_ENABLED */

                    idx++;
                }

                 #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
                    if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
                    {
                        min_diff = accum_raw[0u+snsIdx] - (int32_t)ptrWdCfg->ptrSnsContext[0u+snsIdx].bsln;
                        averBsln = (int32_t)ptrWdCfg->ptrSnsContext[0u+snsIdx].bsln;
                        for (idx = 1u; idx < mpOrderLocal; idx++)
                        {
                            /* Find the lowest diff value */
                            diff = accum_raw[idx+snsIdx] - (int32_t)ptrWdCfg->ptrSnsContext[idx+snsIdx].bsln;
                            if (min_diff > diff)
                            {
                                min_diff = diff;
                            }

                            /* Calculate sum of baselines in the pattern */
                            averBsln += (int32_t)ptrWdCfg->ptrSnsContext[idx+snsIdx].bsln;
                        }

                        /* Calculate average baseline */
                        averBsln += (averBsln > 0) ? ((int32_t)mpOrderLocal / 2) : (-(int32_t)mpOrderLocal / 2);
                        averBsln /= (int32_t)mpOrderLocal;

                        /* Calculate total shift */
                        min_diff = (int32_t)rawDataShift - min_diff - averBsln;
                        if (min_diff > (int32_t)CY_CAPSENSE_RAW_COUNT_MAX_VALUE)
                        {
                            min_diff_second = (uint16_t)CY_CAPSENSE_RAW_COUNT_MAX_VALUE;
                        } else if (min_diff < 0)
                        {
                            min_diff_second = 0u;
                        }
                        else
                        {
                            min_diff_second = (uint16_t)min_diff;
                        }

                        /* Apply aligning algorithm */
                        for (idx = 0u; idx < mpOrderLocal; idx++)
                        {
                            ptrWdCfg->ptrSnsContext[idx+snsIdx].raw = ((uint16_t)accum_raw[idx+snsIdx] + min_diff_second);
                        }
                    }
                 #endif

                snsIdx += mpOrderLocal;
            }
        }
    }
    return result;
}
#endif


