zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_processing.c
/*******************************************************************************
* Function Name: Cy_CapSense_PreProcessWidget
****************************************************************************//**
*
* Executes the pre-processing of scan raw data for specified widgets.
*
* This function is called prior any other processing function for
* the fifth CAPSENSE&trade; and  fifth low power CAPSENSE&trade; HW generation.
* The pre-processing routine implements the following operations:
* - Limits raw count to maximum value.
* - Executes the raw data inversion for the CSX ans ISX sensors.
*
* No need to call this function from application layer since the
* Cy_CapSense_ProcessAllWidgets() and Cy_CapSense_ProcessWidget() functions
* calls it automatically.
*
* If specific processing is implemented using the Cy_CapSense_ProcessWidgetExt()
* and Cy_CapSense_ProcessSensorExt() function then a call of this function is
* required prior doing the specific processing. If Multi-phase is enabled
* then deconvolution should be executed after call of this function using
* the Cy_CapSense_ProcessWidgetMpDeconvolution() function.
*
* \param widgetId
* The widget ID, for which the pre-processing should be executed.
*
* \note For the fifth-generation low power CAPSENSE&trade; widgets
* of the \ref CY_CAPSENSE_WD_LOW_POWER_E type are not processed.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_PreProcessWidget(
                uint32_t widgetId,
                const cy_stc_capsense_context_t * context)
{
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) ||\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) ||\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN))
        const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    #endif /* Suppress possible compiler warning */

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E != ptrWdCfg->wdType)
#endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */
    {
        /* Limit raw count to the maximum possible raw count value */
        Cy_CapSense_PreProcessWidgetLimitRaw(widgetId, context);

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) ||\
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN))
            /* Inverts raw count for CSX and ISX widgets */
            if ((CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod) ||
                (CY_CAPSENSE_ISX_GROUP == ptrWdCfg->senseMethod))
            {
                Cy_CapSense_PreProcessWidgetInvertRaw(widgetId, context);
            }
        #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                   (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)) */

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
            if (((uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E == ptrWdCfg->wdType) &&
                (0u != ptrWdCfg->wbxCorrectionEn) &&
                (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_INITIALIZATION_MASK)))
            {
                Cy_CapSense_ProcessWbxCorrection(ptrWdCfg, context);
            }
        #endif
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_PreProcessSensor
****************************************************************************//**
*
* Executes the pre-processing of scan raw data for specified sensor.
*
* This function is called prior any other processing function for
* the fifth CAPSENSE&trade; and fifth low power HW generation.
* The pre-processing routine implements the following operations:
* - Limits raw count to maximum value.
* - Executes the raw data inversion for the CSX and ISX sensors.
*
* No need to call this function from application layer since the
* Cy_CapSense_ProcessAllWidgets() and Cy_CapSense_ProcessWidget() functions
* calls it automatically.
*
* If specific processing is implemented using the Cy_CapSense_ProcessWidgetExt()
* and Cy_CapSense_ProcessSensorExt() function then a call of this function is
* required prior doing the specific processing. If Multi-phase is enabled
* then deconvolution should be executed after pre-processing of all sensors
* of the specified widget using the Cy_CapSense_ProcessWidgetMpDeconvolution()
* function.
*
* \param widgetId
* The widget ID, for which the pre-processing should be executed.
*
* \note For the fifth-generation low power CAPSENSE&trade; widgets
* of the \ref CY_CAPSENSE_WD_LOW_POWER_E type are not processed.
*
* \param sensorId
* The sensor ID, for which the pre-processing should be executed.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_PreProcessSensor(
                uint32_t widgetId,
                uint32_t sensorId,
                const cy_stc_capsense_context_t * context)
{
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) ||\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) ||\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN))
        const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    #endif /* Suppress possible compiler warning */

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E != ptrWdCfg->wdType)
#endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */
    {
        /* Limit raw count to the maximum possible raw count value */
        Cy_CapSense_PreProcessSensorLimitRaw(widgetId, sensorId, context);

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) ||\
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN))
            /* Inverts raw count for CSX and ISX widgets */
            if ((CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod) ||
                (CY_CAPSENSE_ISX_GROUP == ptrWdCfg->senseMethod))
            {
                Cy_CapSense_PreProcessSensorInvertRaw(widgetId, sensorId, context);
            }
        #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) ||\
                   (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)) */
    }
}


